app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "updated_at", "name", "description") VALUES ('2011-04-05 21:57:16.925361', '2011-04-05 21:57:16.925361', 'American', 'Food, damnit.')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save