app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
  def index
    @places = Place.all(:include => :category)

SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1)
SELECT "places".* FROM "places" WHERE "places"."id" = 1 LIMIT 1
---
  def show
    @place = Place.find(params[:id], :include => :category)

INSERT INTO "places" ("name", "updated_at", "is_catered", "created_at", "category_id") VALUES ('Burger King', '2011-04-05 21:57:33.554698', 'f', '2011-04-05 21:57:33.554698', 1)
---
  def create
    @place = Place.new(params[:place])

    respond_to do |format|
      if @place.save