app/controllers/selections_controller.rb

  def index
    @selections = Selection.all(:include => {:place => :category})
---
SELECT "selections".* FROM "selections"

  def current
    date = Date.today
    @selection = Selection.first(:conditions => {:date_created => date})
    if @selection.blank?
      places = Place.all
      @selection = Selection.new(:date_created => date, :place_id => places[rand(places.length)].id)
      @selection.save
    end
    @ups = Vote.count(:conditions => {:selection_id => @selection.id, :is_up => true})
---
SELECT "selections"."id" FROM "selections" WHERE ("selections"."date_created" = '2011-04-05') LIMIT 1
SELECT "places".* FROM "places"
INSERT INTO "selections" ("place_id", "date_created") VALUES (1, '2011-04-06')
SELECT COUNT(*) FROM "votes" WHERE "votes"."selection_id" = 1 AND "votes"."is_up" = 't'

  def vote
    vote_hash = {:user_id => session[:user_id], :selection_id => params[:selection_id]}
    vote = Vote.first(:conditions => vote_hash)
    vote_hash[:is_up] = params[:vote_value] == 'up'
    if vote.blank?
      vote = Vote.new(vote_hash)
      vote.save
---
INSERT INTO "votes" ("is_up", "user_id", "selection_id", "updated_at", "created_at") VALUES ('t', NULL, 1, '2011-04-05 21:29:44.967999', '2011-04-05 21:29:44.967999')
UPDATE "votes" SET "updated_at" = '2011-04-05 21:33:15.942318', "is_up" = 'f' WHERE "votes"."id" = 3