app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "hashed_password", "created_at", "updated_at") VALUES ('yuriy1337', 'yuriy1337@gmail.com', '4dd7c4be948f4cf5d4e5911261979983ad2be0b1b0b06e17767f4469f8730f57e81418d2319a9180', '2011-04-13 01:33:51.767240', '2011-04-13 01:33:51.767240')