app/views/places/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %><br />
    <%= f.collection_select :category_id, Category.all, :id, :name %>